from sqlite3 import connect as sqlite3_connect
import os
from shutil import copy2 as shutil_copy2
from subprocess import call

from config import *
from logs import *

# ----------------------------------------------------------------------------------------------------------------------
# Копируем файл БД закладок FireFox в папку проекта
# ----------------------------------------------------------------------------------------------------------------------
shutil_copy2(path_bookmarks, 'src/places.sqlite')

# ----------------------------------------------------------------------------------------------------------------------
# Подключились к БД закладок FireFox
# ----------------------------------------------------------------------------------------------------------------------
connection = sqlite3_connect('src/places.sqlite')
with connection:
    log_debug('Подключение к БД прошло успешно')
    log_info('Начата проверка закладок папки \"' + name_bookmarks_folder + '\"')
    cursor = connection.cursor()
    
    # ----------------------------------------------------------------------------------------------------------------------
    # Создаем текстовый файл закладок не проверенных модов
    # ----------------------------------------------------------------------------------------------------------------------
    f_write = open(f'docs/{name_text_file}.txt', 'w', encoding='utf-8')

    # ----------------------------------------------------------------------------------------------------------------------
    # Находим id папки закладок переданной из config
    # ----------------------------------------------------------------------------------------------------------------------
    folder_all_bookmarks = cursor.execute(f"select id from moz_bookmarks where title=\'{name_bookmarks_folder}\'").fetchone()

    # ----------------------------------------------------------------------------------------------------------------------
    # Проверяем существование папки закладок переданной из config
    # ----------------------------------------------------------------------------------------------------------------------
    if folder_all_bookmarks:
        id_folder_all_bookmarks = folder_all_bookmarks[0]
        
        # ----------------------------------------------------------------------------------------------------------------------
        # Находим id и name папок категорий закладок
        # ----------------------------------------------------------------------------------------------------------------------
        categories = cursor.execute(f"select id, title from moz_bookmarks where parent={id_folder_all_bookmarks}")
        for categorie in categories.fetchall():
            id_categorie, name_categorie = categorie
            
            # ----------------------------------------------------------------------------------------------------------------------
            # Находим id и name закладок в категориях
            # ----------------------------------------------------------------------------------------------------------------------
            categorie_bookmarks = cursor.execute(f"select guid, title from moz_bookmarks where parent={id_categorie}").fetchall()
                    
            # ----------------------------------------------------------------------------------------------------------------------
            # Проверяем есть ли закладки
            # ----------------------------------------------------------------------------------------------------------------------
            if categorie_bookmarks:
                
                # ----------------------------------------------------------------------------------------------------------------------
                # Записываем имя категории и количество закладок в ней в файл
                # ----------------------------------------------------------------------------------------------------------------------
                quantity = len(categorie_bookmarks)
                f_write.write(name_categorie + '\n')
                f_write.write(str(quantity) + '\n---------------------------------------------------------------------------------------------\n')
        log_info('Информация о количестве закладок в категориях сохранена в файл: ' + name_text_file + '.txt')
    else:
        log_warning(f'Папка \"{name_bookmarks_folder}\" не найдена')

connection.close()

#os.startfile(f'docs/{name_text_file}.txt')
call(["kate", f'docs/{name_text_file}.txt'])